In [11]:
import pandas as pd
import pyodbc
from sqlalchemy import create_engine

In [12]:
database_connection = (
    "mssql+pyodbc://LAPTOP-R3E5KI54\SQLEXPRESS/HR?"
    "driver=ODBC+Driver+17+for+SQL+Server"
)

In [14]:
engine = create_engine(database_connection)

In [53]:
query = """select employee_id,first_name,department_name,email,hire_date,salary from employees e join departments d on e.department_id = d.department_id"""

In [54]:
df = pd.read_sql(query,engine)

In [55]:
df

,employee_id,first_name,department_name,email,hire_date,salary
0,100,Steven,Executive,steven.king@sqltutorial.org,1987-06-17,24000
1,101,Neena,Executive,neena.kochhar@sqltutorial.org,1989-09-21,17000
2,102,Lex,Executive,lex.de haan@sqltutorial.org,1993-01-13,17000
3,103,Alexander,IT,alexander.hunold@sqltutorial.org,1990-01-03,9000
4,104,Bruce,IT,bruce.ernst@sqltutorial.org,1991-05-21,6000
5,105,David,IT,david.austin@sqltutorial.org,1997-06-25,4800
6,106,Valli,IT,valli.pataballa@sqltutorial.org,1998-02-05,4800
7,107,Diana,IT,diana.lorentz@sqltutorial.org,1999-02-07,4200
8,108,Nancy,Finance,nancy.greenberg@sqltutorial.org,1994-08-17,12000
9,109,Daniel,Finance,daniel.faviet@sqltutorial.org,1994-08-16,9000
10,110,John,Finance,john.chen@sqltutorial.org,1997-09-28,8200
11,111,Ismael,Finance,ismael.sciarra@sqltutorial.org,1997-09-30,7700
12,112,Jose Manuel,Finance,jose manuel.urman@sqltutorial.org,1998-03-07,7800
13,113,Luis,Finance,luis.popp@sqltutorial.org,1999-12-07,6900
14,114,Den,Purchasing,den.raphaely@sqltutorial.org,1994-12-07,11000
15,115,Alexander,Purchasing,alexander.khoo@sqltutorial.org,1995-05-18,3100
16,116,Shelli,Purchasing,shelli.baida@sqltutorial.org,1997-12-24,2900
17,117,Sigal,Purchasing,sigal.tobias@sqltutorial.org,1997-07-24,2800
18,118,Guy,Purchasing,guy.himuro@sqltutorial.org,1998-11-15,2600
19,119,Karen,Purchasing,karen.colmenares@sqltutorial.org,1999-08-10,2500
20,120,Matthew,Shipping,matthew.weiss@sqltutorial.org,1996-07-18,8000
21,121,Adam,Shipping,adam.fripp@sqltutorial.org,1997-04-10,8200
22,122,Payam,Shipping,payam.kaufling@sqltutorial.org,1995-05-01,7900
23,123,Shanta,Shipping,shanta.vollman@sqltutorial.org,1997-10-10,6500
24,126,Irene,Shipping,irene.mikkilineni@sqltutorial.org,1998-09-28,2700
25,145,John,Sales,john.russell@sqltutorial.org,1996-10-01,14000
26,146,Karen,Sales,karen.partners@sqltutorial.org,1997-01-05,13500
27,176,Jonathon,Sales,jonathon.taylor@sqltutorial.org,1998-03-24,8600
28,177,Jack,Sales,jack.livingston@sqltutorial.org,1998-04-23,8400
29,178,Kimberely,Sales,kimberely.grant@sqltutorial.org,1999-05-24,7000
30,179,Charles,Sales,charles.johnson@sqltutorial.org,2000-01-04,6200
31,192,Abhishek,Shipping,sarah.bell@sqltutorial.org,1996-02-04,4000
32,193,Britney,Shipping,britney.everett@sqltutorial.org,1997-03-03,3900
33,200,Jennifer,Administration,jennifer.whalen@sqltutorial.org,1987-09-17,4400
34,201,Michael,Marketing,michael.hartstein@sqltutorial.org,1996-02-17,13000
35,202,Pat,Marketing,pat.fay@sqltutorial.org,1997-08-17,6000
36,203,Susan,Human Resources,susan.mavris@sqltutorial.org,1994-06-07,6500
37,204,Hermann,Public Relations,hermann.baer@sqltutorial.org,1994-06-07,10000
38,205,Shelley,Accounting,shelley.higgins@sqltutorial.org,1994-06-07,12000
39,206,William,Accounting,william.gietz@sqltutorial.org,1994-06-07,8300

In [25]:
import pandas as pd
import oracledb
from sqlalchemy import create_engine

In [29]:
oracledb.init_oracle_client(lib_dir=r"C:\oraclexe\app\oracle\instantclient_19_29")

In [32]:
DB_Connection = create_engine("oracle+oracledb://ETL_Automation:ETL_Automation@localhost:1521/xe")

In [33]:
query = """select * from customer"""

In [38]:
query_1 = """select * from products"""

In [41]:
df_oracle = pd.read_sql(query,DB_Connection)

In [43]:
df_oracle.to_parquet('Products_parquet.parquet', engine = 'pyarrow',index = False)

In [44]:
oracle_par = pd.read_parquet('Products_parquet.parquet')

In [47]:
df_sort = df_oracle.sort_values(by ='customerid',ascending = False)

In [48]:
df_sort

   customerid     name          phone
14       C015   Olivia  (321)654-0987
13       C014     Noah   123-456-7890
12       C013      Mia     1113335555
11       C012      Leo     2223334444
10       C011    Karen   555-666-7777
9        C010     Jack     7654321000
8        C009      Ian  (999)888-7777
7        C008   Hannah     1112223333
6        C007    Grace     8887776666
5        C006    Frank   333-444-5555
4        C005     Emma     4445556666
3        C004    David   (222)3334444
2        C003  Charlie   555-123-4567
1        C002      Bob     9876543210
0        C001    Alice     1234567890

In [57]:
df_sort1 = df.sort_values(by=['salary','employee_id'],ascending = [True,False])

In [58]:
df_sort1

,employee_id,first_name,department_name,email,hire_date,salary
19,119,Karen,Purchasing,karen.colmenares@sqltutorial.org,1999-08-10,2500
18,118,Guy,Purchasing,guy.himuro@sqltutorial.org,1998-11-15,2600
24,126,Irene,Shipping,irene.mikkilineni@sqltutorial.org,1998-09-28,2700
17,117,Sigal,Purchasing,sigal.tobias@sqltutorial.org,1997-07-24,2800
16,116,Shelli,Purchasing,shelli.baida@sqltutorial.org,1997-12-24,2900
15,115,Alexander,Purchasing,alexander.khoo@sqltutorial.org,1995-05-18,3100
32,193,Britney,Shipping,britney.everett@sqltutorial.org,1997-03-03,3900
31,192,Abhishek,Shipping,sarah.bell@sqltutorial.org,1996-02-04,4000
7,107,Diana,IT,diana.lorentz@sqltutorial.org,1999-02-07,4200
33,200,Jennifer,Administration,jennifer.whalen@sqltutorial.org,1987-09-17,4400
6,106,Valli,IT,valli.pataballa@sqltutorial.org,1998-02-05,4800
5,105,David,IT,david.austin@sqltutorial.org,1997-06-25,4800
35,202,Pat,Marketing,pat.fay@sqltutorial.org,1997-08-17,6000
4,104,Bruce,IT,bruce.ernst@sqltutorial.org,1991-05-21,6000
30,179,Charles,Sales,charles.johnson@sqltutorial.org,2000-01-04,6200
36,203,Susan,Human Resources,susan.mavris@sqltutorial.org,1994-06-07,6500
23,123,Shanta,Shipping,shanta.vollman@sqltutorial.org,1997-10-10,6500
13,113,Luis,Finance,luis.popp@sqltutorial.org,1999-12-07,6900
29,178,Kimberely,Sales,kimberely.grant@sqltutorial.org,1999-05-24,7000
11,111,Ismael,Finance,ismael.sciarra@sqltutorial.org,1997-09-30,7700
12,112,Jose Manuel,Finance,jose manuel.urman@sqltutorial.org,1998-03-07,7800
22,122,Payam,Shipping,payam.kaufling@sqltutorial.org,1995-05-01,7900
20,120,Matthew,Shipping,matthew.weiss@sqltutorial.org,1996-07-18,8000
21,121,Adam,Shipping,adam.fripp@sqltutorial.org,1997-04-10,8200
10,110,John,Finance,john.chen@sqltutorial.org,1997-09-28,8200
39,206,William,Accounting,william.gietz@sqltutorial.org,1994-06-07,8300
28,177,Jack,Sales,jack.livingston@sqltutorial.org,1998-04-23,8400
27,176,Jonathon,Sales,jonathon.taylor@sqltutorial.org,1998-03-24,8600
9,109,Daniel,Finance,daniel.faviet@sqltutorial.org,1994-08-16,9000
3,103,Alexander,IT,alexander.hunold@sqltutorial.org,1990-01-03,9000
37,204,Hermann,Public Relations,hermann.baer@sqltutorial.org,1994-06-07,10000
14,114,Den,Purchasing,den.raphaely@sqltutorial.org,1994-12-07,11000
38,205,Shelley,Accounting,shelley.higgins@sqltutorial.org,1994-06-07,12000
8,108,Nancy,Finance,nancy.greenberg@sqltutorial.org,1994-08-17,12000
34,201,Michael,Marketing,michael.hartstein@sqltutorial.org,1996-02-17,13000
26,146,Karen,Sales,karen.partners@sqltutorial.org,1997-01-05,13500
25,145,John,Sales,john.russell@sqltutorial.org,1996-10-01,14000
2,102,Lex,Executive,lex.de haan@sqltutorial.org,1993-01-13,17000
1,101,Neena,Executive,neena.kochhar@sqltutorial.org,1989-09-21,17000
0,100,Steven,Executive,steven.king@sqltutorial.org,1987-06-17,24000

In [59]:
df_sort2 = df.sort_values(by='salary',ascending = True)

In [60]:
df_sort2

,employee_id,first_name,department_name,email,hire_date,salary
19,119,Karen,Purchasing,karen.colmenares@sqltutorial.org,1999-08-10,2500
18,118,Guy,Purchasing,guy.himuro@sqltutorial.org,1998-11-15,2600
24,126,Irene,Shipping,irene.mikkilineni@sqltutorial.org,1998-09-28,2700
17,117,Sigal,Purchasing,sigal.tobias@sqltutorial.org,1997-07-24,2800
16,116,Shelli,Purchasing,shelli.baida@sqltutorial.org,1997-12-24,2900
15,115,Alexander,Purchasing,alexander.khoo@sqltutorial.org,1995-05-18,3100
32,193,Britney,Shipping,britney.everett@sqltutorial.org,1997-03-03,3900
31,192,Abhishek,Shipping,sarah.bell@sqltutorial.org,1996-02-04,4000
7,107,Diana,IT,diana.lorentz@sqltutorial.org,1999-02-07,4200
33,200,Jennifer,Administration,jennifer.whalen@sqltutorial.org,1987-09-17,4400
6,106,Valli,IT,valli.pataballa@sqltutorial.org,1998-02-05,4800
5,105,David,IT,david.austin@sqltutorial.org,1997-06-25,4800
4,104,Bruce,IT,bruce.ernst@sqltutorial.org,1991-05-21,6000
35,202,Pat,Marketing,pat.fay@sqltutorial.org,1997-08-17,6000
30,179,Charles,Sales,charles.johnson@sqltutorial.org,2000-01-04,6200
23,123,Shanta,Shipping,shanta.vollman@sqltutorial.org,1997-10-10,6500
36,203,Susan,Human Resources,susan.mavris@sqltutorial.org,1994-06-07,6500
13,113,Luis,Finance,luis.popp@sqltutorial.org,1999-12-07,6900
29,178,Kimberely,Sales,kimberely.grant@sqltutorial.org,1999-05-24,7000
11,111,Ismael,Finance,ismael.sciarra@sqltutorial.org,1997-09-30,7700
12,112,Jose Manuel,Finance,jose manuel.urman@sqltutorial.org,1998-03-07,7800
22,122,Payam,Shipping,payam.kaufling@sqltutorial.org,1995-05-01,7900
20,120,Matthew,Shipping,matthew.weiss@sqltutorial.org,1996-07-18,8000
21,121,Adam,Shipping,adam.fripp@sqltutorial.org,1997-04-10,8200
10,110,John,Finance,john.chen@sqltutorial.org,1997-09-28,8200
39,206,William,Accounting,william.gietz@sqltutorial.org,1994-06-07,8300
28,177,Jack,Sales,jack.livingston@sqltutorial.org,1998-04-23,8400
27,176,Jonathon,Sales,jonathon.taylor@sqltutorial.org,1998-03-24,8600
3,103,Alexander,IT,alexander.hunold@sqltutorial.org,1990-01-03,9000
9,109,Daniel,Finance,daniel.faviet@sqltutorial.org,1994-08-16,9000
37,204,Hermann,Public Relations,hermann.baer@sqltutorial.org,1994-06-07,10000
14,114,Den,Purchasing,den.raphaely@sqltutorial.org,1994-12-07,11000
38,205,Shelley,Accounting,shelley.higgins@sqltutorial.org,1994-06-07,12000
8,108,Nancy,Finance,nancy.greenberg@sqltutorial.org,1994-08-17,12000
34,201,Michael,Marketing,michael.hartstein@sqltutorial.org,1996-02-17,13000
26,146,Karen,Sales,karen.partners@sqltutorial.org,1997-01-05,13500
25,145,John,Sales,john.russell@sqltutorial.org,1996-10-01,14000
1,101,Neena,Executive,neena.kochhar@sqltutorial.org,1989-09-21,17000
2,102,Lex,Executive,lex.de haan@sqltutorial.org,1993-01-13,17000
0,100,Steven,Executive,steven.king@sqltutorial.org,1987-06-17,24000

In [61]:
df_count_emp = df.groupby('department_name')['first_name'].count().reset_index()

In [63]:
df_count_emp.rename(columns = {'first_name':'emp_count'})

     department_name  emp_count
0         Accounting          2
1     Administration          1
2          Executive          3
3            Finance          6
4    Human Resources          1
5                 IT          5
6          Marketing          2
7   Public Relations          1
8         Purchasing          6
9              Sales          6
10          Shipping          7

In [69]:
df_dept_sal = df.groupby(['department_name','salary'])['first_name'].count().reset_index()

In [70]:
df_dept_sal.rename(columns = {'first_name':'emp_count'})

     department_name  salary  emp_count
0         Accounting    8300          1
1         Accounting   12000          1
2     Administration    4400          1
3          Executive   17000          2
4          Executive   24000          1
5            Finance    6900          1
6            Finance    7700          1
7            Finance    7800          1
8            Finance    8200          1
9            Finance    9000          1
10           Finance   12000          1
11   Human Resources    6500          1
12                IT    4200          1
13                IT    4800          2
14                IT    6000          1
15                IT    9000          1
16         Marketing    6000          1
17         Marketing   13000          1
18  Public Relations   10000          1
19        Purchasing    2500          1
20        Purchasing    2600          1
21        Purchasing    2800          1
22        Purchasing    2900          1
23        Purchasing    3100          1
24        Purchasing   11000          1
25             Sales    6200          1
26             Sales    7000          1
27             Sales    8400          1
28             Sales    8600          1
29             Sales   13500          1
30             Sales   14000          1
31          Shipping    2700          1
32          Shipping    3900          1
33          Shipping    4000          1
34          Shipping    6500          1
35          Shipping    7900          1
36          Shipping    8000          1
37          Shipping    8200          1

In [72]:
df_agg_all = df.groupby('department_name')['salary'].agg(['count','sum','max','min']).reset_index()

In [74]:
col_name = {'count':'emp_count','sum':'emp_sum','max':'emp_max','min':'emp_min'}

In [76]:
df_agg_all.rename(columns = col_name)

     department_name  emp_count  emp_sum  emp_max  emp_min
0         Accounting          2    20300    12000     8300
1     Administration          1     4400     4400     4400
2          Executive          3    58000    24000    17000
3            Finance          6    51600    12000     6900
4    Human Resources          1     6500     6500     6500
5                 IT          5    28800     9000     4200
6          Marketing          2    19000    13000     6000
7   Public Relations          1    10000    10000    10000
8         Purchasing          6    24900    11000     2500
9              Sales          6    57700    14000     6200
10          Shipping          7    41200     8200     2700

In [77]:
df_sal = df['salary'] <=10000

In [81]:
df_grouped = df[df_sal].groupby('department_name')['salary'].sum().reset_index().rename(columns = {'salary':'sum_sal'})

In [82]:
df_grouped

    department_name  sum_sal
0        Accounting     8300
1    Administration     4400
2           Finance    39600
3   Human Resources     6500
4                IT    28800
5         Marketing     6000
6  Public Relations    10000
7        Purchasing    13900
8             Sales    30200
9          Shipping    41200

In [88]:
df_groupp = df.groupby('department_name')['salary'].sum()

In [89]:
df_hav = df_groupp.apply(lambda x:x<10000)

In [90]:
df_res = df_groupp[df_hav].reset_index()

In [91]:
df_res

   department_name  salary
0   Administration    4400
1  Human Resources    6500